In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series, DataFrame

# 5.1 Introduction to pandas Data Structures

## Series

## ---> Series is a 1 dimensional array like object containing a sequence of values (of similar types of NumPy types) and an associated array of data labels, called its index.

In [83]:
obj = pd.Series([4, 7, -5, 3])

In [84]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values # Accessing values of obj.

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj.index # Like range(4)

RangeIndex(start=0, stop=4, step=1)

In [17]:
obj2 = pd.Series([4, 7, -5, 3], index=['a', 's', 'r', 'v']) # Giving our own index to object.

In [18]:
obj2

a    4
s    7
r   -5
v    3
dtype: int64

In [19]:
obj2.index

Index(['a', 's', 'r', 'v'], dtype='object')

In [20]:
obj2['a']

4

In [21]:
obj2['s']

7

In [22]:
obj2['v']

3

In [26]:
obj2['r']

-5

In [30]:
obj2[['a', 'r', 's']]

a    4
r   -5
s    7
dtype: int64

In [31]:
obj2[['v', 's', 'r']]

v    3
s    7
r   -5
dtype: int64

In [36]:
obj2[obj2 >= 4]

a    4
s    7
dtype: int64

In [38]:
obj2[obj2 < 1]

r   -5
dtype: int64

In [40]:
obj2[obj2 == 7]

s    7
dtype: int64

In [42]:
obj2 * 2 # It will multiplies the obj2 with 2. just llike NumPy array.

a     8
s    14
r   -10
v     6
dtype: int64

In [81]:
np.exp(obj2)

a      54.598150
s    1096.633158
r       0.006738
v      20.085537
dtype: float64

In [51]:
'a' in obj2

True

In [52]:
's' in obj2

True

In [53]:
'e' in obj2

False

In [54]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [55]:
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [56]:

obj3 = pd.Series(sdata)

In [57]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [63]:
states = ['Texas', 'Atalanta', 'New Jersy', 'Utah']

In [64]:
obj4 = pd.Series(sdata, index=states)

In [65]:
obj4

Texas        71000.0
Atalanta         NaN
New Jersy        NaN
Utah          5000.0
dtype: float64

In [66]:
pd.isnull(obj4)

Texas        False
Atalanta      True
New Jersy     True
Utah         False
dtype: bool

In [69]:
obj4.isnull()

Texas        False
Atalanta      True
New Jersy     True
Utah         False
dtype: bool

In [70]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [71]:
obj4

Texas        71000.0
Atalanta         NaN
New Jersy        NaN
Utah          5000.0
dtype: float64

In [72]:
obj3 + obj4

Atalanta          NaN
New Jersy         NaN
Ohio              NaN
Oregon            NaN
Texas        142000.0
Utah          10000.0
dtype: float64

In [73]:
obj4.name = 'population'

In [74]:
obj4

Texas        71000.0
Atalanta         NaN
New Jersy        NaN
Utah          5000.0
Name: population, dtype: float64

In [75]:
obj4.index.name = 'States'

In [76]:
obj4

States
Texas        71000.0
Atalanta         NaN
New Jersy        NaN
Utah          5000.0
Name: population, dtype: float64

In [85]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [86]:
obj.index = ['bhavik', 'mehul', 'jay', 'jignesh']

In [87]:
obj

bhavik     4
mehul      7
jay       -5
jignesh    3
dtype: int64

## DataFrame

## ---> A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.).

In [3]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

In [5]:
frame = pd.DataFrame(data)

In [6]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [8]:
frame.head() # head() method will select only first five rows among all data.

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [9]:
pd.DataFrame(data, columns=['pop', 'state', 'year'])

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [11]:
pd.DataFrame(data, columns=['state', 'pop', 'year'])

    state  pop  year
0    Ohio  1.5  2000
1    Ohio  1.7  2001
2    Ohio  3.6  2002
3  Nevada  2.4  2001
4  Nevada  2.9  2002
5  Nevada  3.2  2003

In [12]:
pd.DataFrame(data, columns=['year', 'pop', 'state'])

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [13]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])

In [14]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [15]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [16]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [17]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [18]:
frame2['pop']

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
six      3.2
Name: pop, dtype: float64

In [19]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [20]:
frame2.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [21]:
frame2.loc['two']

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [29]:
frame2['debt'] = np.arange(6.)

In [30]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [31]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [33]:
frame2['debt'] = val

In [34]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [39]:
frame2['eastern'] = frame2.state == 'Ohio'

In [40]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [41]:
del frame2['eastern']

In [42]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [20]:
pop = {
    "Nevada": {2001:2.4, 2002:2.9},
    "Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}
}

In [21]:
frame3 = pd.DataFrame(pop)

In [22]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [23]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [24]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [25]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [26]:
pdata = {
    'Ohio': frame3['Ohio'][:1],
    'Nevada': frame3['Nevada'][:2]
}

In [27]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   NaN     2.9

In [28]:
frame3.index.name = 'year'

In [29]:
frame3.columns.name = 'state'

In [30]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [31]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [32]:
frame2.values

NameError: name 'frame2' is not defined

## Index Objects

## ---> pandas's index objects are responsible for holding the labels and other metadata (like the axis name or names). Any array or other sequence of labels you use when constructing a Series of DataFrame is internally converted to an Index.

In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series, DataFrame

In [4]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [5]:
index = obj.index

In [6]:
index

Index(['a', 'b', 'c'], dtype='object')

In [7]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [10]:
index[1:] # 1st index as well as all after 1st index.

Index(['b', 'c'], dtype='object')

In [11]:
index[1] = 'd' #Type Error (We cannot assign new values of index because they are immutable)

TypeError: Index does not support mutable operations

In [12]:
labels = pd.Index(np.arange(3))

In [13]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [16]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [17]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [18]:
obj2.index is labels

True

In [33]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [35]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [36]:
frame3.index

Int64Index([2001, 2002, 2000], dtype='int64', name='year')

In [37]:
'Ohio' in frame3.columns

True

In [38]:
'India' in frame3.columns

False

In [40]:
2003 in frame3.index

False

In [42]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [43]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')